### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "demo-s3-terraform-dev"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Answer"      = "42"
+           "Environment" = "dev"
+           "Name"        = "demo-s3-terraform-dev"
+           "Source"      = "terraform"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = "arn:aws:kms:us-east-1:484752921218:key/3302dc1f-a868-455e-b6c7-fed535416290"
+                   sse_algorithm     = "aws:kms"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.this will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>